html/org-pages/qc1/week18.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-07 Mon 10:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Week 18 - my notes</title>
<meta name="author" content="Luís Spengler" />
<meta name="description" content="Week 18 - my notes" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Week 18 - my notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org14d93dd">Week 18 - Quantum Algorithms and Quantum Advantage</a>
<ul>
<li><a href="#orgaa84a4d">Quantum Algorithms</a></li>
<li><a href="#orgc39f05b">Algorithms 101</a></li>
<li><a href="#orgf8ca08d">Linear Search Algorithms</a></li>
<li><a href="#orge75dc0b">What makes a good algorithm?</a></li>
<li><a href="#org7c7d0db">Quantum Algorithms</a></li>
<li><a href="#org29efad1">What makes a quantum algorithm?</a></li>
<li><a href="#orgaa13050">The Quantum Algos Landscape</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
&ldquo;I try to understand the limitations of [quantum] algorithms&#x2026; it goes hand in hand with understanding what is possible.&rdquo; - Scott Aaronson
</p>

<div id="outline-container-org14d93dd" class="outline-2">
<h2 id="org14d93dd">Week 18 - Quantum Algorithms and Quantum Advantage</h2>
<div class="outline-text-2" id="text-org14d93dd">
</div>
<div id="outline-container-orgaa84a4d" class="outline-3">
<h3 id="orgaa84a4d">Quantum Algorithms</h3>
<div class="outline-text-3" id="text-orgaa84a4d">
<ul class="org-ul">
<li>It is how a quantum computer solves problems</li>
</ul>
</div>
</div>

<div id="outline-container-orgc39f05b" class="outline-3">
<h3 id="orgc39f05b">Algorithms 101</h3>
<div class="outline-text-3" id="text-orgc39f05b">
<ul class="org-ul">
<li>Algorithms are a set of steps taken to solve a problem. They are like a recipe to accomplish some task (like baking a nice cake!)</li>
<li>Let&rsquo;s focus on <b>linear search</b> right now</li>
</ul>
</div>
</div>

<div id="outline-container-orgf8ca08d" class="outline-3">
<h3 id="orgf8ca08d">Linear Search Algorithms</h3>
<div class="outline-text-3" id="text-orgf8ca08d">
<ul class="org-ul">
<li>They focus on finding an specific element, by checking each individual element in a dataset</li>
<li>In the worst case scenario, these algorithms would take N steps to find an N number of values</li>
</ul>
</div>
</div>

<div id="outline-container-orge75dc0b" class="outline-3">
<h3 id="orge75dc0b">What makes a good algorithm?</h3>
<div class="outline-text-3" id="text-orge75dc0b">
<ul class="org-ul">
<li>Solve the problem correctly (Accuracy)</li>
<li>Solve the problem as quickly as possible (Efficiency)</li>
</ul>
</div>

<div id="outline-container-org85f1d0b" class="outline-4">
<h4 id="org85f1d0b">Solve the problem (accuracy/efficiency)</h4>
<div class="outline-text-4" id="text-org85f1d0b">
<ul class="org-ul">
<li>You can make an algorithm that will eventually give you the right answer, but at what cost?</li>
<li>Efficiency is a more important problem to solve, and it is usually how we determine good algorithms</li>
<li>But how can we quantify its efficiency?</li>
</ul>
</div>
</div>

<div id="outline-container-org6bb9446" class="outline-4">
<h4 id="org6bb9446">Determining Efficiency</h4>
<div class="outline-text-4" id="text-org6bb9446">
<ul class="org-ul">
<li>We shouldn&rsquo;t examine it by the runtime (it is hardware dependent, and it also depends on the input difficulty and size)</li>
<li>Instead of using runtine, we count how many steps an algorithm took. This is known as Big-O Notation</li>
</ul>
</div>
</div>

<div id="outline-container-orgbf38de8" class="outline-4">
<h4 id="orgbf38de8">Big-O Notation</h4>
<div class="outline-text-4" id="text-orgbf38de8">
<ul class="org-ul">
<li>Big-O reports the number of operations and it characterizes the worst-case performance, as well as being expressed as function of input size.</li>
<li>Linear Search&rsquo;s big-o notation: \[O(n)\]</li>
<li>From top (more efficient) to bottom (less efficient):</li>
</ul>
<p>
\[O(1)\] \[O(log(n))\] \[O(\sqrt{n})\] \[O(n)\] \[O(n^2)\] \[O(2^n)\] \[O(n!)\]
</p>
<ul class="org-ul">
<li>When we are designing a quantum algorithm our goal is to have a better efficiency compared to classical ones:</li>
</ul>
<p>
\[O(Quantum) < O(Classical)\]
</p>
</div>
</div>
</div>

<div id="outline-container-org7c7d0db" class="outline-3">
<h3 id="org7c7d0db">Quantum Algorithms</h3>
<div class="outline-text-3" id="text-org7c7d0db">
<ul class="org-ul">
<li>It is a procedure for solving a computational problem that uses the 3 quantum resources (superposition, interference, entanglement)</li>
<li>The goal is to show the quantum advantage (idea of being able to solve a problem in a QC faster than any classical device. It means the same as quantum supremacy, but this term is less used nowadays)</li>
<li>We do not expect a quantum advantage for all types of problems, however we do expect such thing in optimization and simulation problems</li>
</ul>
</div>
</div>

<div id="outline-container-org29efad1" class="outline-3">
<h3 id="org29efad1">What makes a quantum algorithm?</h3>
<div class="outline-text-3" id="text-org29efad1">
<ul class="org-ul">
<li>It is just a complicated quantum circuit!</li>
<li>All quantum algorithms are quantum circuits, but not all quantum circuits are not quantum algorithms</li>
<li>All quantum algorithms are done by finding matrixes that can get you to the state you want to</li>
</ul>
</div>
</div>

<div id="outline-container-orgaa13050" class="outline-3">
<h3 id="orgaa13050">The Quantum Algos Landscape</h3>
<div class="outline-text-3" id="text-orgaa13050">
<ul class="org-ul">
<li>Deutsch-Josza (First theorical demonstration of quantum advantage) \[O(1) << O(2^n)\]</li>
<li>Shor&rsquo;s algorithm (Super-polynomial speedup for factoring using the QFT) \[O(log(n)^3) << O(n^{1.9})\]</li>
<li>Grover Search (Quadratic speedup for search using amplitude amplification) \[O(\sqrt{n}) << O(n)\]</li>
<li>Near-term Algos (Applications of noisy, small available quantum devices)</li>
</ul>
</div>

<div id="outline-container-org6ca7b01" class="outline-4">
<h4 id="org6ca7b01">Limitations of Quantum Algorithms</h4>
<div class="outline-text-4" id="text-org6ca7b01">
<ul class="org-ul">
<li>We don&rsquo;t have enough qubits and they are too noisy and have errors &#x2013; they lose information</li>
<li>Maturation of quantum coding languages</li>
<li>We need different types of algorithms for different problems</li>
<li>Designing algorithms for different potential types of hardware</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luís Spengler</p>
<p class="date">Created: 2022-03-07 Mon 10:50</p>
</div>
</body>
</html>
